---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.AreaVolumeSettings
source: html/c52b1eb2-9874-eb2c-fbc4-fd98bb08fe3c.htm
---
# AreaVolumeSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.